[Killed] BlockStatement
src/Roller.ts:8:5
     private _faces: number;
   
     constructor(faces: number)
-    {
-      // The number of faces must be at least 2. If it is not a valid number, default to 6.
-      this._faces = (faces >= 2 && Number.isInteger(faces)) ? faces : 6;
-      this._last = 0;
-      this._distribution = new Map<number, number>();
-      for (let i = 1; i <= this._faces; i++) 
-      {
-        this._distribution.set(i, 0);
-      }
-    }
+    {}
   
     roll(value: number): number 
killedBy: Roller tests Roll a valid number and check if the last roll is correct.
statusReason: TypeError: Cannot read properties of undefined (reading 'set')

[Survived] ConditionalExpression
src/Roller.ts:10:22
     constructor(faces: number)
     {
       // The number of faces must be at least 2. If it is not a valid number, default to 6.
-      this._faces = (faces >= 2 && Number.isInteger(faces)) ? faces : 6;
+      this._faces = (true && Number.isInteger(faces)) ? faces : 6;
       this._last = 0;
       this._distribution = new Map<number, number>();

[Survived] ConditionalExpression
src/Roller.ts:10:22
     constructor(faces: number)
     {
       // The number of faces must be at least 2. If it is not a valid number, default to 6.
-      this._faces = (faces >= 2 && Number.isInteger(faces)) ? faces : 6;
+      this._faces = (true) ? faces : 6;
       this._last = 0;
       this._distribution = new Map<number, number>();

[Killed] ConditionalExpression
src/Roller.ts:13:23
       this._faces = (faces >= 2 && Number.isInteger(faces)) ? faces : 6;
       this._last = 0;
       this._distribution = new Map<number, number>();
-      for (let i = 1; i <= this._faces; i++) 
+      for (let i = 1; false; i++) 
       {
         this._distribution.set(i, 0);
killedBy: Roller tests Check if the distribution is updated after rolling the die.
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 3

  Map {
-   1 => 1,
-   2 => 1,

[Killed] EqualityOperator
src/Roller.ts:13:23
       this._faces = (faces >= 2 && Number.isInteger(faces)) ? faces : 6;
       this._last = 0;
       this._distribution = new Map<number, number>();
-      for (let i = 1; i <= this._faces; i++) 
+      for (let i = 1; i > this._faces; i++) 
       {
         this._distribution.set(i, 0);
killedBy: Roller tests Check if the distribution is updated after rolling the die.
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 3

  Map {
-   1 => 1,
-   2 => 1,

[Killed] BlockStatement
src/Roller.ts:14:7
       this._last = 0;
       this._distribution = new Map<number, number>();
       for (let i = 1; i <= this._faces; i++) 
-      {
-        this._distribution.set(i, 0);
-      }
+      {}
     }
   
killedBy: Roller tests Check if the distribution is updated after rolling the die.
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 3

  Map {
-   1 => 1,
-   2 => 1,

[Killed] BlockStatement
src/Roller.ts:20:5
     }
   
     roll(value: number): number 
-    {
-      if (!Number.isInteger(value) || value < 1 || value > this._faces)
-      {
-        // Invalid value provided. No record of the roll should be made.
-        return 0;
-      }
-      // Record the roll.
-      this._last = value;
-      this._distribution.set(value, this._distribution.get(value) + 1);
-      return value;
-    }
+    {}
   
     last(): number 
killedBy: Roller tests Roll a valid number and check if the last roll is correct.
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 4
Received: 0

[Killed] ConditionalExpression
src/Roller.ts:21:39
   
     roll(value: number): number 
     {
-      if (!Number.isInteger(value) || value < 1 || value > this._faces)
+      if (!Number.isInteger(value) || false || value > this._faces)
       {
         // Invalid value provided. No record of the roll should be made.
killedBy: Roller tests Roll an invalid number and check if the last roll is still 0.
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: -1

[Killed] LogicalOperator
src/Roller.ts:21:11
   
     roll(value: number): number 
     {
-      if (!Number.isInteger(value) || value < 1 || value > this._faces)
+      if ((!Number.isInteger(value) || value < 1) && value > this._faces)
       {
         // Invalid value provided. No record of the roll should be made.
killedBy: Roller tests Roll an invalid number and check if the last roll is still 0.
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: -1

[Killed] BlockStatement
src/Roller.ts:22:7
     roll(value: number): number 
     {
       if (!Number.isInteger(value) || value < 1 || value > this._faces)
-      {
-        // Invalid value provided. No record of the roll should be made.
-        return 0;
-      }
+      {}
       // Record the roll.
       this._last = value;
killedBy: Roller tests Roll an invalid number and check if the last roll is still 0.
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: -1

[Killed] BlockStatement
src/Roller.ts:33:5
     }
   
     last(): number 
-    {
-      return this._last;
-    }
+    {}
   
     distribution(): Map<number, number> 
killedBy: Roller tests Roll a valid number and check if the last roll is correct.
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 4
Received: undefined

[Killed] BlockStatement
src/Roller.ts:38:5
     }
   
     distribution(): Map<number, number> 
-    {
-      // Return a copy of the distribution map to prevent external modification.
-      return new Map<number, number>(this._distribution);
-    }
+    {}
   }
  
killedBy: Roller tests Check if the distribution is updated after rolling the die.
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: Map {1 => 1, 2 => 1, 3 => 1, 4 => 0, 5 => 0, 6 => 0}
Received: undefined
